<template>
  <div class="hello">
    <div id="world"></div>
  </div>
</template>

<script>
import * as topojson from 'topojson-client';

export default {
  name: 'HelloWorld',
  props: {
    msg: String
  },
  mounted () {

    let config = {
      width : 360,
      height : 560,
      padding : 10,
      projection : d3.geoMercator(),
      duration : 3000,
      key:function(d){
        return d.properties.county;
      },
      grid: {
        "新北市1": {
          "x": 11,
          "y": 0
        },
        "新北市2": {
          "x": 12,
          "y": 0
        },
        "新北市3": {
          "x": 10,
          "y": 1
        },
        "新北市4": {
          "x": 10,
          "y": 2
        },
        "新北市5": {
          "x": 11,
          "y": 2
        },
        "新北市6": {
          "x": 12,
          "y": 2
        },
        "新北市7": {
          "x": 13,
          "y": 2
        },
        "新北市8": {
          "x": 14,
          "y": 2
        },
        "新北市9": {
          "x": 14,
          "y": 1
        },
        "新北市10": {
          "x": 11,
          "y": 3
        },
        "臺北市1": {
          "x": 11,
          "y": 1
        },
        "臺北市2": {
          "x": 12,
          "y": 1
        },
        "基隆市": {
          "x": 13,
          "y": 1
        },
        "宜蘭縣1": {
          "x": 12,
          "y": 3
        },
        "宜蘭縣2": {
          "x": 13,
          "y": 3
        },
        "宜蘭縣3": {
          "x": 11,
          "y": 4
        },
        "宜蘭縣4": {
          "x": 12,
          "y": 4
        },
        "宜蘭縣5": {
          "x": 13,
          "y": 4
        },
        "宜蘭縣6": {
          "x": 11,
          "y": 5
        },
        "宜蘭縣7": {
          "x": 12,
          "y": 5
        },
        "宜蘭縣8": {
          "x": 13,
          "y": 5
        },
        "宜蘭縣9": {
          "x": 10,
          "y": 6
        },
        "宜蘭縣10": {
          "x": 11,
          "y": 6
        },
        "宜蘭縣11": {
          "x": 12,
          "y": 6
        },
        "宜蘭縣12": {
          "x": 13,
          "y": 6
        },
        "桃園縣1": {
          "x": 9,
          "y": 1
        },
        "桃園縣2": {
          "x": 8,
          "y": 2
        },
        "桃園縣3": {
          "x": 9,
          "y": 2
        },
        "桃園縣4": {
          "x": 10,
          "y": 3
        },
        "桃園縣5": {
          "x": 10,
          "y": 4
        },
        "新竹縣1": {
          "x": 8,
          "y": 3
        },
        "新竹縣2": {
          "x": 9,
          "y": 3
        },
        "新竹縣3": {
          "x": 7,
          "y": 4
        },
        "新竹縣4": {
          "x": 8,
          "y": 4
        },
        "新竹縣5": {
          "x": 9,
          "y": 4
        },
        "新竹縣6": {
          "x": 8,
          "y": 5
        },
        "新竹縣7": {
          "x": 9,
          "y": 5
        },
        "新竹縣8": {
          "x": 10,
          "y": 5
        },
        "新竹市": {
          "x": 7,
          "y": 3
        },
        "苗栗縣1": {
          "x": 6,
          "y": 4
        },
        "苗栗縣2": {
          "x": 5,
          "y": 5
        },
        "苗栗縣3": {
          "x": 6,
          "y": 5
        },
        "苗栗縣4": {
          "x": 7,
          "y": 5
        },
        "苗栗縣5": {
          "x": 5,
          "y": 6
        },
        "苗栗縣6": {
          "x": 6,
          "y": 6
        },
        "苗栗縣7": {
          "x": 7,
          "y": 6
        },
        "苗栗縣8": {
          "x": 8,
          "y": 6
        },
        "苗栗縣9": {
          "x": 9,
          "y": 6
        },
        "苗栗縣10": {
          "x": 6,
          "y": 7
        },
        "臺中市1": {
          "x": 4,
          "y": 7
        },
        "臺中市2": {
          "x": 5,
          "y": 7
        },
        "臺中市3": {
          "x": 4,
          "y": 8
        },
        "臺中市4": {
          "x": 5,
          "y": 8
        },
        "臺中市5": {
          "x": 5,
          "y": 9
        },
        "臺中市6": {
          "x": 6,
          "y": 8
        },
        "臺中市7": {
          "x": 7,
          "y": 8
        },
        "臺中市8": {
          "x": 7,
          "y": 7
        },
        "臺中市9": {
          "x": 8,
          "y": 7
        },
        "臺中市10": {
          "x": 9,
          "y": 7
        },
        "臺中市11": {
          "x": 10,
          "y": 7
        },
        "花蓮縣1": {
          "x": 11,
          "y": 7
        },
        "花蓮縣2": {
          "x": 12,
          "y": 7
        },
        "花蓮縣3": {
          "x": 13,
          "y": 7
        },
        "花蓮縣4": {
          "x": 10,
          "y": 8
        },
        "花蓮縣5": {
          "x": 11,
          "y": 8
        },
        "花蓮縣6": {
          "x": 12,
          "y": 8
        },
        "花蓮縣7": {
          "x": 10,
          "y": 9
        },
        "花蓮縣8": {
          "x": 11,
          "y": 9
        },
        "花蓮縣9": {
          "x": 10,
          "y": 10
        },
        "花蓮縣10": {
          "x": 11,
          "y": 10
        },
        "花蓮縣11": {
          "x": 9,
          "y": 11
        },
        "花蓮縣12": {
          "x": 10,
          "y": 11
        },
        "花蓮縣13": {
          "x": 11,
          "y": 11
        },
        "花蓮縣14": {
          "x": 9,
          "y": 12
        },
        "花蓮縣15": {
          "x": 10,
          "y": 12
        },
        "花蓮縣16": {
          "x": 11,
          "y": 12
        },
        "花蓮縣17": {
          "x": 9,
          "y": 13
        },
        "花蓮縣18": {
          "x": 10,
          "y": 13
        },
        "花蓮縣19": {
          "x": 11,
          "y": 13
        },
        "花蓮縣20": {
          "x": 8,
          "y": 14
        },
        "花蓮縣21": {
          "x": 9,
          "y": 14
        },
        "花蓮縣22": {
          "x": 10,
          "y": 14
        },
        "花蓮縣23": {
          "x": 8,
          "y": 15
        },
        "花蓮縣24": {
          "x": 9,
          "y": 15
        },
        "花蓮縣25": {
          "x": 10,
          "y": 15
        },
        "花蓮縣26": {
          "x": 8,
          "y": 16
        },
        "花蓮縣27": {
          "x": 9,
          "y": 16
        },
        "南投縣1": {
          "x": 8,
          "y": 8
        },
        "南投縣2": {
          "x": 9,
          "y": 8
        },
        "南投縣3": {
          "x": 6,
          "y": 9
        },
        "南投縣4": {
          "x": 7,
          "y": 9
        },
        "南投縣5": {
          "x": 8,
          "y": 9
        },
        "南投縣6": {
          "x": 9,
          "y": 9
        },
        "南投縣7": {
          "x": 5,
          "y": 10
        },
        "南投縣8": {
          "x": 6,
          "y": 10
        },
        "南投縣9": {
          "x": 7,
          "y": 10
        },
        "南投縣10": {
          "x": 8,
          "y": 10
        },
        "南投縣11": {
          "x": 9,
          "y": 10
        },
        "南投縣12": {
          "x": 5,
          "y": 11
        },
        "南投縣13": {
          "x": 6,
          "y": 11
        },
        "南投縣14": {
          "x": 7,
          "y": 11
        },
        "南投縣15": {
          "x": 8,
          "y": 11
        },
        "南投縣16": {
          "x": 5,
          "y": 12
        },
        "南投縣17": {
          "x": 6,
          "y": 12
        },
        "南投縣18": {
          "x": 7,
          "y": 12
        },
        "南投縣19": {
          "x": 8,
          "y": 12
        },
        "南投縣20": {
          "x": 6,
          "y": 13
        },
        "南投縣21": {
          "x": 7,
          "y": 13
        },
        "南投縣22": {
          "x": 8,
          "y": 13
        },
        "南投縣23": {
          "x": 6,
          "y": 14
        },
        "南投縣24": {
          "x": 7,
          "y": 14
        },
        "彰化縣1": {
          "x": 3,
          "y": 9
        },
        "彰化縣2": {
          "x": 4,
          "y": 9
        },
        "彰化縣3": {
          "x": 2,
          "y": 10
        },
        "彰化縣4": {
          "x": 3,
          "y": 10
        },
        "彰化縣5": {
          "x": 4,
          "y": 10
        },
        "彰化縣6": {
          "x": 2,
          "y": 11
        },
        "彰化縣7": {
          "x": 3,
          "y": 11
        },
        "彰化縣8": {
          "x": 4,
          "y": 11
        },
        "雲林縣1": {
          "x": 1,
          "y": 13
        },
        "雲林縣2": {
          "x": 1,
          "y": 12
        },
        "雲林縣3": {
          "x": 2,
          "y": 12
        },
        "雲林縣4": {
          "x": 3,
          "y": 12
        },
        "雲林縣5": {
          "x": 4,
          "y": 12
        },
        "雲林縣6": {
          "x": 4,
          "y": 13
        },
        "嘉義市1": {
          "x": 1,
          "y": 15
        },
        "嘉義市2": {
          "x": 1,
          "y": 14
        },
        "嘉義市3": {
          "x": 2,
          "y": 14
        },
        "嘉義市4": {
          "x": 2,
          "y": 13
        },
        "嘉義市5": {
          "x": 3,
          "y": 13
        },
        "嘉義市6": {
          "x": 3,
          "y": 14
        },
        "嘉義市7": {
          "x": 4,
          "y": 14
        },
        "嘉義市8": {
          "x": 4,
          "y": 15
        },
        "嘉義市9": {
          "x": 5,
          "y": 15
        },
        "嘉義市10": {
          "x": 5,
          "y": 14
        },
        "嘉義市11": {
          "x": 5,
          "y": 13
        },
        "臺南市1": {
          "x": 2,
          "y": 15
        },
        "臺南市2": {
          "x": 3,
          "y": 15
        },
        "臺南市3": {
          "x": 1,
          "y": 16
        },
        "臺南市4": {
          "x": 2,
          "y": 16
        },
        "臺南市5": {
          "x": 3,
          "y": 16
        },
        "臺南市6": {
          "x": 4,
          "y": 16
        },
        "臺南市7": {
          "x": 0,
          "y": 17
        },
        "臺南市8": {
          "x": 1,
          "y": 17
        },
        "臺南市9": {
          "x": 2,
          "y": 17
        },
        "臺南市10": {
          "x": 3,
          "y": 17
        },
        "臺南市11": {
          "x": 1,
          "y": 18
        },
        "臺南市12": {
          "x": 2,
          "y": 18
        },
        "臺東縣1": {
          "x": 7,
          "y": 16
        },
        "臺東縣2": {
          "x": 10,
          "y": 16
        },
        "臺東縣3": {
          "x": 7,
          "y": 17
        },
        "臺東縣4": {
          "x": 8,
          "y": 17
        },
        "臺東縣5": {
          "x": 9,
          "y": 17
        },
        "臺東縣6": {
          "x": 10,
          "y": 17
        },
        "臺東縣7": {
          "x": 6,
          "y": 18
        },
        "臺東縣8": {
          "x": 7,
          "y": 18
        },
        "臺東縣9": {
          "x": 8,
          "y": 18
        },
        "臺東縣10": {
          "x": 9,
          "y": 18
        },
        "臺東縣11": {
          "x": 8,
          "y": 19
        },
        "臺東縣12": {
          "x": 9,
          "y": 19
        },
        "臺東縣13": {
          "x": 8,
          "y": 20
        },
        "臺東縣14": {
          "x": 7,
          "y": 21
        },
        "臺東縣15": {
          "x": 7,
          "y": 19
        },
        "臺東縣16": {
          "x": 7,
          "y": 20
        },
        "臺東縣17": {
          "x": 6,
          "y": 21
        },
        "臺東縣18": {
          "x": 6,
          "y": 22
        },
        "臺東縣19": {
          "x": 6,
          "y": 23
        },
        "臺東縣20": {
          "x": 6,
          "y": 24
        },
        "高雄市1": {
          "x": 1,
          "y": 19
        },
        "高雄市2": {
          "x": 2,
          "y": 19
        },
        "高雄市3": {
          "x": 3,
          "y": 19
        },
        "高雄市4": {
          "x": 4,
          "y": 19
        },
        "高雄市5": {
          "x": 6,
          "y": 19
        },
        "高雄市6": {
          "x": 3,
          "y": 18
        },
        "高雄市7": {
          "x": 4,
          "y": 18
        },
        "高雄市8": {
          "x": 5,
          "y": 18
        },
        "高雄市9": {
          "x": 4,
          "y": 17
        },
        "高雄市10": {
          "x": 5,
          "y": 17
        },
        "高雄市11": {
          "x": 6,
          "y": 17
        },
        "高雄市12": {
          "x": 5,
          "y": 16
        },
        "高雄市13": {
          "x": 6,
          "y": 16
        },
        "高雄市14": {
          "x": 6,
          "y": 15
        },
        "高雄市15": {
          "x": 7,
          "y": 15
        },
        "高雄市16": {
          "x": 2,
          "y": 20
        },
        "高雄市17": {
          "x": 2,
          "y": 21
        },
        "屏東縣1": {
          "x": 5,
          "y": 19
        },
        "屏東縣2": {
          "x": 3,
          "y": 20
        },
        "屏東縣3": {
          "x": 4,
          "y": 20
        },
        "屏東縣4": {
          "x": 5,
          "y": 20
        },
        "屏東縣5": {
          "x": 6,
          "y": 20
        },
        "屏東縣6": {
          "x": 3,
          "y": 21
        },
        "屏東縣7": {
          "x": 4,
          "y": 21
        },
        "屏東縣8": {
          "x": 5,
          "y": 21
        },
        "屏東縣9": {
          "x": 3,
          "y": 22
        },
        "屏東縣10": {
          "x": 4,
          "y": 22
        },
        "屏東縣11": {
          "x": 5,
          "y": 22
        },
        "屏東縣12": {
          "x": 4,
          "y": 23
        },
        "屏東縣13": {
          "x": 5,
          "y": 23
        },
        "屏東縣14": {
          "x": 5,
          "y": 24
        },
        "屏東縣15": {
          "x": 5,
          "y": 25
        },
        "屏東縣16": {
          "x": 5,
          "y": 26
        },
        "屏東縣17": {
          "x": 6,
          "y": 25
        },
        "屏東縣18": {
          "x": 6,
          "y": 26
        },
        "屏東縣19": {
          "x": 6,
          "y": 27
        },
        "連江縣": {
          "x": 0,
          "y": 0
        },
        "嘉義縣": {
          "x": 0,
          "y": 1
        },
        "金門縣": {
          "x": 1,
          "y": 0
        },
        "澎湖縣": {
          "x": 1,
          "y": 1
        }
      }
    };

    let svg = d3.select('#world').append('svg').attr('width',config.width).attr('height',config.height);

    let g2r = new geo2rect.draw();
    d3.json('./json/twcountry2020.json', function(err, data){

      // let feature = topojson.feature(data, data.objects["COUNTY_MOI_1081121"]);
      var geojson = geo2rect.compute(data);
      g2r.config = config;
      g2r.data = geojson;
      g2r.svg = svg.append('g').attr('class', "boxs");
      
      g2r.draw();
      let box = d3.selectAll('path')
         box
         .attr('class', "box")
         .attr('fill', "blue")
         .attr('stroke', "white")
         .attr('stroke-width', '2px')


      setTimeout(function(){
         g2r.toggle();
         g2r.draw();
         let box = d3.selectAll('path')
         box
         .attr('class', "box")
         .attr('fill', "green")
         .attr('stroke', "white")
         .attr('stroke-width', '2px')
         console.log(box)
      }, 3000)

      setTimeout(function(){
         g2r.toggle();
      }, 4000)

      console.log(g2r.mode);
    });

  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">
.boxs {
  border: solid 1px red;
  .box {
    transform: scale(0.5);
  }
}
</style>
